Scripts APIs/POS_API2.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="4.0" jmeter="4.0 r1823414">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Performance POS (/purchases)" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variáveis Definidas Pelo Usuário" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Point of Sales API" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador de Iteração" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <longProp name="ThreadGroup.start_time">1517933923000</longProp>
        <longProp name="ThreadGroup.end_time">1517933923000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsImtpZCI6Im12emtyeGpnNjZyanM5ZDliYzJ3OXZ4OXk5bXU1amRqIiwidHlwIjoiSldUIn0.eyJuYmYiOjE1MzQ0NDgwODcsImV4cCI6MTUzNzA0MDA4NywiaXNzIjoiaHR0cHM6Ly91YXQtYXBpLmRvdHpsYWJzLmNvbS9hY2NvdW50cy92MSIsImF1ZCI6WyJodHRwczovL3VhdC1hcGkuZG90emxhYnMuY29tL2FjY291bnRzL3YxL3Jlc291cmNlcyIsInBvcy5hcGkiXSwiY2xpZW50X2lkIjoiVEJOSjBCWjJLRkpSVU5OIiwiY2xpZW50X2FwcGxpY2F0aW9uX2xlZ2FjeV9pZCI6IjEwMTI3NTkiLCJjbGllbnRfcHJvZ3JhbV9pZCI6IjEiLCJjbGllbnRfcmVkZWVtX29yaWdpbiI6IjQxIiwic2NvcGUiOlsicG9zLmFwaSJdfQ.FK5jhEcEPiKLziNgNrwMq0I5DfmH1Jky5AhMz1TFfrKkiN2035JnMp6-_pRRjMlMUa8VSTOzkN9jgWUNUFYnQgt8PK8UdFx5zENXXizNlLG_syOstc71XZFer9jO3qz9QmG7ToofU4DO6tA6NxkVwKXVlLOFmlaTgYxI2n0DZt5kcXXkXqfC7A91kUAzWchahsw_EYHY0LHdduXeX1mx0IQMY2Mty-Sfj7hqtkOvERieNaOXEw7-PKQHkjTDBrC7mb8yuUXY4mbGCO0-UKsifGQ1vViMm1RSuEVgiIuXTID0f7QRwkw6bC2Tj1X27MGGCKfT838NxJHOIJce_0NJbw</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /purchases" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;locator&quot;: &quot;${__RandomString(10,abcdefghijklmnopqrstuvwxyz,)}&quot;,&#xd;
    &quot;storeCode&quot;: &quot;Matriz&quot;,&#xd;
    &quot;deviceCode&quot;: &quot;41&quot;,&#xd;
    &quot;purchaseDate&quot;: &quot;${__time(yyyy/MM/dd HH:mm:ss.SSS&apos;Z&apos;)}&quot;,&#xd;
    &quot;shopperIdentification&quot;: &quot;04467490523&quot;,&#xd;
    &quot;employeeIdentification&quot;: &quot;&quot;,&#xd;
    &quot;calculatePoints&quot;: false,&#xd;
    &quot;offerCode&quot;: &quot;469&quot;,&#xd;
    &quot;points&quot;: 1,&#xd;
    &quot;items&quot;: [&#xd;
            {&#xd;
                &quot;sku&quot;: &quot;654321&quot;, &#xd;
                &quot;ean&quot;: &quot;123456&quot;, &#xd;
                &quot;quantity&quot;: 2, &#xd;
                &quot;unitPrice&quot;: 10.60, &#xd;
                &quot;itemPrice&quot;: 21.20, &#xd;
                &quot;supplierIdentification&quot;: &quot;61506481000104&quot;, &#xd;
                &quot;name&quot;: &quot;Produto Teste Paulistão&quot;,&#xd;
                &quot;discount&quot;: 5.63, &#xd;
                &quot;offerCode&quot;: &quot;469&quot;, &#xd;
                &quot;points&quot;: 1 &#xd;
            }&#xd;
    ],&#xd;
    &quot;purchaseValue&quot;: 16.0,&#xd;
    &quot;payments&quot;: [&#xd;
        {&#xd;
            &quot;paymentType&quot;: 1,&#xd;
            &quot;bin&quot;: &quot;&quot;,&#xd;
            &quot;amount&quot;: 16.00&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">uat-api.dotzlabs.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.path">pos/v1/purchases</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Asserções de Resposta" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Asserção de Duração" enabled="false">
            <stringProp name="DurationAssertion.duration">2000</stringProp>
          </DurationAssertion>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="false">
            <stringProp name="JSONPostProcessor.referenceNames">locator</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.locator</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">0</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="AssertionVisualizer" testclass="ResultCollector" testname="Resultados de Asserção" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Ver Árvore de Resultados" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="Ver Resultados em Tabela" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">C:\code\performance-scripts\Relatorios\pos.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ProxyControl guiclass="ProxyControlGui" testclass="ProxyControl" testname="Servidor HTTP Proxy" enabled="false">
        <stringProp name="ProxyControlGui.port">8888</stringProp>
        <collectionProp name="ProxyControlGui.exclude_list"/>
        <collectionProp name="ProxyControlGui.include_list"/>
        <boolProp name="ProxyControlGui.capture_http_headers">true</boolProp>
        <intProp name="ProxyControlGui.grouping_mode">0</intProp>
        <boolProp name="ProxyControlGui.add_assertion">false</boolProp>
        <boolProp name="ProxyControlGui.sampler_redirect_automatically">false</boolProp>
        <boolProp name="ProxyControlGui.sampler_follow_redirects">true</boolProp>
        <boolProp name="ProxyControlGui.use_keepalive">true</boolProp>
        <boolProp name="ProxyControlGui.sampler_download_images">false</boolProp>
        <boolProp name="ProxyControlGui.notify_child_sl_filtered">true</boolProp>
        <boolProp name="ProxyControlGui.regex_match">false</boolProp>
        <intProp name="ProxyControlGui.proxy_http_sampler_naming_mode">0</intProp>
      </ProxyControl>
      <hashTree>
        <RecordingController guiclass="RecordController" testclass="RecordingController" testname="Controlador de Gravação" enabled="false"/>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>